{"type":"data","nodes":[null,null,{"type":"data","data":[{"publication":1,"meta":31},{"name":2,"shortName":3,"youtube":4,"description":5,"shortDescription":6,"image":7,"tags":8,"authors":16,"venue":20,"reference":21,"links":22,"date":29,"slug":30},"StitchFlow: Crochet Patterns With Stitch Tracking and Process Sharing (2025)","StitchFlow","https://www.youtube.com/watch?v=Qo6rLz8-52Y","Crochet is a manual craft characterized by improvisation and creative flow, which can be disrupted by tasks like documenting patterns and tracking progress. To address this, StitchFlow was developed to help crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns. The system allows users to view, edit, and combine designs through a graphical interface, supporting creativity and variation. It also facilitates sharing by exporting documentation as written patterns, crochet charts, or interactive flows. User studies with eight crocheters showed that StitchFlow preserved creative flow, encouraged exploration, and made pattern sharing easier.","A system that helps crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns.","/images/publications/stitchflow.png",[9,12,14],{"label":10,"color":11},"Interactive Systems","primary",{"label":13,"color":11},"Craft",{"label":15,"color":11},"Crochet",[17,18,19],"Zofia Marciniak","Punn Lertjaturaphat","Andrea Bianchi","UIST 2025","Reference 1",[23,26],{"text":24,"url":25},"paper","/files/publications/Marciniak_StitchFlow_UIST2025.pdf",{"text":27,"url":28},"doi","https://doi.org/10.1145/3746059.3747715","2025-10-20","stitchflow-2025",{"canonical":32,"keywords":33,"description":6,"title":34,"image":7},"https://punnlert.com/publications/stitchflow-2025","Interactive Systems, Craft, Crochet, Industrial Design, Interaction Design, Human-Computer Interaction, UX Design, UI Design, Punn Lertjaturaphat, Portfolio","Punn Lertjaturaphat's Personal Portfolio - StitchFlow"],"uses":{"params":["publication"]}}]}
