{"type":"data","nodes":[null,null,{"type":"data","data":[{"publication":1,"meta":32},{"name":2,"shortName":3,"description":4,"shortDescription":5,"image":6,"tags":7,"authors":15,"venue":20,"reference":21,"links":22,"date":26,"slug":27,"awards":28},"Wire Your Way: Hardware-Contextualized Guidance and In-situ Tests for Personalized Circuit Prototyping (2026)","WireWay","The increasing popularity of microcontroller platforms like Arduino enablesdiverse end-user developers to participate in circuit prototyping. Traditionally, follow-along tutorials serve as an essential learning method for makers, and in fact, several prior toolkits leveraged this format as a way to engage new makers. However, literature and our formative study (N=12) show that makers have unique preferences regarding the construction of their circuits and idiosyncratic ways to assess and debug problems, which contrasts with the step-by-step instructional nature of tutorials and those systems leveraging this method. To address this mismatch, we present a prototyping platform that supports personalized circuit construction and debugging. Our system utilizes an augmented breadboard, which is circuit-aware and supports on-the-fly hardware reconfiguration via contextualized guidance and in-situ circuit validation through interactive tests. Through a usability study (N=12), we demonstrate how makers leverage circuit-aware guidance and debugging to support individual building patterns.","A circuit prototyping system that supports personalized construction and debugging practices using a circuit-aware augmented breadboard with contextual guidance and in-situ validation.","/images/publications/wireway.png",[8,11,13],{"label":9,"color":10},"Physical Computing","primary",{"label":12,"color":10},"Debugging",{"label":14,"color":10},"Programming",[16,17,18,19],"Punn Lertjaturaphat*","Jungwoo Rhee*","Jaewon You","Andrea Bianchi","CHI 2026","Reference 1",[23],{"text":24,"url":25},"pre-print","/files/publications/Lertjaturaphat_Rhee_WireWay_CHI2026.pdf","2026-04-13","wireway-2026",[29],{"name":30,"logo":31},"To appear at CHI 2026","",{"canonical":33,"keywords":34,"description":5,"title":35,"image":6},"https://punnlert.com/publications/wireway-2026","Physical Computing, Debugging, Programming, Industrial Design, Interaction Design, Human-Computer Interaction, UX Design, UI Design, Punn Lertjaturaphat, Portfolio","WireWay - Punn Lertjaturaphat's Personal Portfolio"],"uses":{"params":["publication"]}}]}
