{"type":"data","nodes":[null,null,{"type":"data","data":[{"publications":1},[2,29,56],{"name":3,"shortName":4,"description":5,"shortDescription":6,"image":7,"tags":8,"authors":16,"venue":21,"reference":22,"links":23,"date":24,"slug":25,"awards":26},"Wire Your Way: Hardware-Contextualized Guidance and In-situ Tests for Personalized Circuit Prototyping (2026)","WireWay","The increasing popularity of microcontroller platforms like Arduino enablesdiverse end-user developers to participate in circuit prototyping. Traditionally, follow-along tutorials serve as an essential learning method for makers, and in fact, several prior toolkits leveraged this format as a way to engage new makers. However, literature and our formative study (N=12) show that makers have unique preferences regarding the construction of their circuits and idiosyncratic ways to assess and debug problems, which contrasts with the step-by-step instructional nature of tutorials and those systems leveraging this method. To address this mismatch, we present a prototyping platform that supports personalized circuit construction and debugging. Our system utilizes an augmented breadboard, which is circuit-aware and supports on-the-fly hardware reconfiguration via contextualized guidance and in-situ circuit validation through interactive tests. Through a usability study (N=12), we demonstrate how makers leverage circuit-aware guidance and debugging to support individual building patterns.","A circuit prototyping system that supports personalized construction and debugging practices using a circuit-aware augmented breadboard with contextual guidance and in-situ validation.","/images/publications/wireway.png",[9,12,14],{"label":10,"color":11},"Physical Computing","primary",{"label":13,"color":11},"Debugging",{"label":15,"color":11},"Programming",[17,18,19,20],"Punn Lertjaturaphat*","Jungwoo Rhee*","Jaewon You","Andrea Bianchi","","Reference 1",[],"2026-04-13","wireway-2026",[27],{"name":28,"logo":21},"To appear at CHI 2026",{"name":30,"shortName":31,"youtube":32,"description":33,"shortDescription":34,"image":35,"tags":36,"authors":43,"venue":46,"reference":22,"links":47,"date":54,"slug":55},"StitchFlow: Crochet Patterns With Stitch Tracking and Process Sharing (2025)","StitchFlow","https://www.youtube.com/watch?v=Qo6rLz8-52Y","Crochet is a manual craft characterized by improvisation and creative flow, which can be disrupted by tasks like documenting patterns and tracking progress. To address this, StitchFlow was developed to help crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns. The system allows users to view, edit, and combine designs through a graphical interface, supporting creativity and variation. It also facilitates sharing by exporting documentation as written patterns, crochet charts, or interactive flows. User studies with eight crocheters showed that StitchFlow preserved creative flow, encouraged exploration, and made pattern sharing easier.","A system that helps crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns.","/images/publications/stitchflow.png",[37,39,41],{"label":38,"color":11},"Interactive Systems",{"label":40,"color":11},"Craft",{"label":42,"color":11},"Crochet",[44,45,20],"Zofia Marciniak","Punn Lertjaturaphat","UIST 2025",[48,51],{"text":49,"url":50},"paper","/files/publications/Marciniak_StitchFlow_UIST2025.pdf",{"text":52,"url":53},"doi","https://doi.org/10.1145/3746059.3747715","2025-10-20","stitchflow-2025",{"name":57,"shortName":58,"youtube":59,"description":60,"shortDescription":61,"image":62,"tags":63,"authors":67,"venue":72,"reference":22,"links":73,"date":78,"slug":79,"awards":80},"Inline Visualization and Manipulation of Real-Time Hardware Logs for Embedded Programs (2024)","Inline","https://www.youtube.com/watch?v=gAf5mNowg7A","The development of user-friendly embedded prototyping systems like Arduino has made creating interactive devices more accessible. However, debugging these systems is challenging due to the intertwined nature of software and hardware issues. Existing tools often require hardware instrumentation or log visualization through serial monitors. To address this, the authors designed Inline, a programming tool that simplifies debugging by displaying hardware logs directly within the code, providing real-time execution flow tracking and an expression language for log manipulation. A study with twelve users demonstrated the tool’s effectiveness in aiding debugging tasks.","A programming tool that simplifies debugging by displaying hardware logs directly within the code, providing real-time execution flow tracking and an expression language for log manipulation.","/images/publications/inline.png",[64,65,66],{"label":10,"color":11},{"label":13,"color":11},{"label":15,"color":11},[20,68,17,69,70,71],"Zhi Lin Yap*","Austin Z. Henley","Kongpyung Justin Moon","Yoonji Kim","EICS 2024",[74,76],{"text":49,"url":75},"/files/publications/Bianchi_Inline_PACM2024.pdf",{"text":52,"url":77},"https://doi.org/10.1145/3660250","2024-05-20","inline-2024",[81],{"name":82,"logo":21},"Honorable Mention"],"uses":{}}]}
