{"type":"data","nodes":[null,null,{"type":"data","data":[{"publications":1},[2,32],{"name":3,"shortName":4,"youtube":5,"description":6,"shortDescription":7,"image":8,"tags":9,"authors":17,"venue":21,"reference":22,"links":23,"date":30,"slug":31},"StitchFlow: Crochet Patterns With Stitch Tracking and Process Sharing (2025)","StitchFlow","https://www.youtube.com/watch?v=Qo6rLz8-52Y","Crochet is a manual craft characterized by improvisation and creative flow, which can be disrupted by tasks like documenting patterns and tracking progress. To address this, StitchFlow was developed to help crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns. The system allows users to view, edit, and combine designs through a graphical interface, supporting creativity and variation. It also facilitates sharing by exporting documentation as written patterns, crochet charts, or interactive flows. User studies with eight crocheters showed that StitchFlow preserved creative flow, encouraged exploration, and made pattern sharing easier.","A system that helps crocheters stay immersed in their work by automatically documenting the process using motion sensors to track hand gestures and stitch patterns.","/images/publications/stitchflow.png",[10,13,15],{"label":11,"color":12},"Interactive Systems","primary",{"label":14,"color":12},"Craft",{"label":16,"color":12},"Crochet",[18,19,20],"Zofia Marciniak","Punn Lertjaturaphat","Andrea Bianchi","UIST 2025","Reference 1",[24,27],{"text":25,"url":26},"paper","files/publications/Marciniak_StitchFlow_UIST2025.pdf",{"text":28,"url":29},"doi","https://doi.org/10.1145/3746059.3747715","2025-10-20","stitchflow-2025",{"name":33,"shortName":34,"youtube":35,"description":36,"shortDescription":37,"image":38,"tags":39,"authors":46,"venue":51,"reference":22,"links":52,"date":57,"slug":58,"awards":59},"Inline Visualization and Manipulation of Real-Time Hardware Logs for Embedded Programs (2024)","Inline","https://www.youtube.com/watch?v=gAf5mNowg7A","The development of user-friendly embedded prototyping systems like Arduino has made creating interactive devices more accessible. However, debugging these systems is challenging due to the intertwined nature of software and hardware issues. Existing tools often require hardware instrumentation or log visualization through serial monitors. To address this, the authors designed Inline, a programming tool that simplifies debugging by displaying hardware logs directly within the code, providing real-time execution flow tracking and an expression language for log manipulation. A study with twelve users demonstrated the tool’s effectiveness in aiding debugging tasks.","A programming tool that simplifies debugging by displaying hardware logs directly within the code, providing real-time execution flow tracking and an expression language for log manipulation.","/images/publications/inline.png",[40,42,44],{"label":41,"color":12},"Physical Computing",{"label":43,"color":12},"Debugging",{"label":45,"color":12},"Programming",[20,47,19,48,49,50],"Zhi Lin Yap","Austin Z. Henley","Kongpyung Justin Moon","Yoonji Kim","EICS 2024",[53,55],{"text":25,"url":54},"files/publications/Bianchi_Inline_PACM2024.pdf",{"text":28,"url":56},"https://doi.org/10.1145/3660250","2024-05-20","inline-2024",[60],"Honorable Mention"],"uses":{}}]}
